def main():
    สวัสดีค่ะหนูชื่อjohnny
    วัตถุดิบข้าวมันไก่

    น่องไก่/สะโพกไก่/อกไก่ (ตามชอบ)
    กระเทียม 3 - 4 หัว
    รากผักชี 6 ราก
    ขิงแก่หั่นเป็นแผ่นบาง 6 แผ่น
    พริกไทย 30 เม็ด
    เกลือ 1 ½ ช้อนโต๊ะ
    น้ำตาลกรวด ½ ช้อนโต๊ะ
    ข้าวสารดิบ 2 ถ้วยตวง
    ซีอิ๊วขาว 3 ช้อนโต๊ะ
    น้ำมันพืช ½ ช้อนโต๊ะ
    แตงกวา
    ผักชี
    วัตถุดิบน้ำจิ้มข้าวมันไก่

    เต้าเจี้ยว 6 ช้อนโต๊ะ
    ขิงแก่สับ 3 ช้อนโต๊ะ
    พริกขี้หนูหั่น 2 ช้อนโต๊ะ
    ซีอิ๊วหวาน 1 ช้อนโต๊ะ
    มะนาว 1 ช้อนโต๊ะ
    น้ำตาลทราย 1 ช้อนโต๊ะ
    น้ำต้มสุก 1 ช้อนโต๊ะ
    วัตถุดิบน้ำซุปฟัก

    ฟักหั่น ½ หัว
    น้ำต้มไก่ 500 มิลลิลิตร
    ซีอิ๊วขาว 1 ช้อนโต๊ะ
    เกลือ ½ ช้อนโต๊ะ
    วิธีทำข้าวมันไก่
    STEP 1 : ต้มไก่ + น้ำซุปฟัก
    ต้มน้ำซุปต้มไก่ โดยใส่ รากผักชี กระเทียม พริกไทย ขิง น้ำตาลกรวด ซีอิ๊วขาว เกลือ เคี่ยวประมาณ 15 นาที นำไก่ลงไปต้มต่อจนไก่สุก ใช้เวลาประมาณ 30 นาที
    นำไก่ที่สุกแล้วไปน็อกในน้ำผสมน้ำแข็ง จนไก่เย็น ใช้เวลาประมาณ 5 – 10 นาที แล้วนำไก่ขึ้นพักให้สะเด็ดน้ำ ทาด้วยน้ำมันพืชบาง ๆ ให้ทั่วชิ้นไก่ พักไว้
    น้ำซุปที่ต้มไก่ให้ช้อนมันออกจากน้ำซุป เอาออกจนน้ำซุปใส ใส่ฟักที่หั่นแล้วลงไปต้ม ปรุงรสด้วยซีอิ๊ว และเกลือ ต้มจนฟักสุก
    TIPS : การต้มไก่ควรใช้ไฟค่อนข้างอ่อน ต้มไปเรื่อย ๆ จะได้น้ำซุปใสเนื้อไก่สวยชวนกินเลยค่า
    STEP 2 : ทำข้าวมันไก่

    หุงข้าวมันไก่ โดยเจียวกระเทียมกับขิงแก่บุบจนหอม ใส่ข้าวสารดิบลงไป ผัดพอเข้ากัน ปรุงรสด้วยเกลือ น้ำมันไก่ที่ช้อนไว้ ผัดอีกรอบแล้วเทใส่หม้อหุงข้าว ใส่น้ำซุปต้มไก่ลงไป หุงจนข้าวสุก อ่านต่อได้ที่ https://www.wongnai.com/recipes/hainanese-chicken-rice?ref=ct
    วิธีทำน้ำจิ้มข้าวมันไก่
    STEP 1 : ทำน้ำจิ้มข้าวมันไก่
    ทำน้ำจิ้มโดยใส่ขิงซอย พริกขี้หนูหั่น เต้าเจี้ยว ซีอิ๊วดำหวาน มะนาว น้ำตาลทราย น้ำต้มสุก คนให้เข้ากัน กินคู่ข้าวมันไก่ อ่านต่อได้ที่ https://www.wongnai.com/recipes/hainanese-chicken-rice?ref=ct
    เห็นไหมคะว่าข้าวมันไก่รสเด็ดสามารถทำกินเองได้ในครัวเรือนนะคะ เมนูที่เด็ก ๆ กินแล้วชอบ ผู้ใหญ่กินแล้วก็ติดใจค่า แค่มีเวลาสักนิด ก็จะได้กินเมนู “ข้าวมันไก่” พร้อมสูตรน้ำจิ้มข้าวมันไก่รสเด็ดมากินแล้ว แต่ถ้ายังไม่จุใจละก็ นี่เลย 3 สูตร “ข้าวมันไก่” ยอดนิยม รสชาติดีไม่แพ้ร้านดัง ส่วนใครจะนำสูตรข้าวมันไก่ที่เราแนะนำไว้ไปเปิดร้านขายก็ไม่ว่ากันน้า

    เรายังมีบทความดี ๆ มาให้เพื่อน ๆ ได้อ่านกัน! อ่านต่อได้ที่ https://www.wongnai.com/recipes/hainanese-chicken-rice?ref=ct
    อร่อยมั้ย